In [2]:
import pandas as pd

In [4]:
x=lambda x,y: x*y
x(4,5)

20

In [12]:
df=pd.read_csv("train.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [15]:
import numpy as np
df["Fare_sqrt"]=df['Fare'].apply(lambda x:np.sqrt(x))
df.sample(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_sqrt
198,199,1,3,"Madigan, Miss. Margaret ""Maggie""",female,NaN,0,0,370370,7.75,NaN,Q,2.783882
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.00,NaN,S,0.000000